Fagear/SDVPCMdecoder/stc007deinterleaver.cpp
#include "stc007deinterleaver.h"

// Matrices for fast Q-correction.
static const uint16_t I_MATRIX[STC007Line::BITS_PER_WORD] =        // I matrix (H-mirrored).
{
    0x0001, 0x0002, 0x0004, 0x0008, 0x0010, 0x0020, 0x0040, 0x0080, 0x0100, 0x0200, 0x0400, 0x0800, 0x1000, 0x2000
};
static const uint16_t TP1_MATRIX[STC007Line::BITS_PER_WORD] =      // T^1 matrix (H-mirrored).
{
    0x2000, 0x0001, 0x0002, 0x0004, 0x0008, 0x0010, 0x0020, 0x0040, 0x2080, 0x0100, 0x0200, 0x0400, 0x0800, 0x1000
};
static const uint16_t TP2_MATRIX[STC007Line::BITS_PER_WORD] =      // T^2 matrix (H-mirrored).
{
    0x1000, 0x2000, 0x0001, 0x0002, 0x0004, 0x0008, 0x0010, 0x0020, 0x1040, 0x2080, 0x0100, 0x0200, 0x0400, 0x0800
};
static const uint16_t TP3_MATRIX[STC007Line::BITS_PER_WORD] =      // T^3 matrix (H-mirrored).
{
    0x0800, 0x1000, 0x2000, 0x0001, 0x0002, 0x0004, 0x0008, 0x0010, 0x0820, 0x1040, 0x2080, 0x0100, 0x0200, 0x0400
};
static const uint16_t TP4_MATRIX[STC007Line::BITS_PER_WORD] =      // T^4 matrix (H-mirrored).
{
    0x0400, 0x0800, 0x1000, 0x2000, 0x0001, 0x0002, 0x0004, 0x0008, 0x0410, 0x0820, 0x1040, 0x2080, 0x0100, 0x0200
};
static const uint16_t TP5_MATRIX[STC007Line::BITS_PER_WORD] =      // T^5 matrix (H-mirrored).
{
    0x0200, 0x0400, 0x0800, 0x1000, 0x2000, 0x0001, 0x0002, 0x0004, 0x0208, 0x0410, 0x0820, 0x1040, 0x2080, 0x0100
};
static const uint16_t TP6_MATRIX[STC007Line::BITS_PER_WORD] =      // T^6 matrix (H-mirrored).
{
    0x0100, 0x0200, 0x0400, 0x0800, 0x1000, 0x2000, 0x0001, 0x0002, 0x0104, 0x0208, 0x0410, 0x0820, 0x1040, 0x2080
};
static const uint16_t TN1_MATRIX[STC007Line::BITS_PER_WORD] =      // T^(-1) matrix (H-mirrored).
{
    0x0002, 0x0004, 0x0008, 0x0010, 0x0020, 0x0040, 0x0080, 0x0101, 0x0200, 0x0400, 0x0800, 0x1000, 0x2000, 0x0001
};
static const uint16_t TN2_MATRIX[STC007Line::BITS_PER_WORD] =      // T^(-2) matrix (H-mirrored).
{
    0x0004, 0x0008, 0x0010, 0x0020, 0x0040, 0x0080, 0x0101, 0x0202, 0x0400, 0x0800, 0x1000, 0x2000, 0x0001, 0x0002
};
static const uint16_t TN3_MATRIX[STC007Line::BITS_PER_WORD] =      // T^(-3) matrix (H-mirrored).
{
    0x0008, 0x0010, 0x0020, 0x0040, 0x0080, 0x0101, 0x0202, 0x0404, 0x0800, 0x1000, 0x2000, 0x0001, 0x0002, 0x0004
};
static const uint16_t TN4_MATRIX[STC007Line::BITS_PER_WORD] =      // T^(-4) matrix (H-mirrored).
{
    0x0010, 0x0020, 0x0040, 0x0080, 0x0101, 0x0202, 0x0404, 0x0808, 0x1000, 0x2000, 0x0001, 0x0002, 0x0004, 0x0008
};
static const uint16_t TN5_MATRIX[STC007Line::BITS_PER_WORD] =      // T^(-5) matrix (H-mirrored).
{
    0x0020, 0x0040, 0x0080, 0x0101, 0x0202, 0x0404, 0x0808, 0x1010, 0x2000, 0x0001, 0x0002, 0x0004, 0x0008, 0x0010
};
static const uint16_t TN6_MATRIX[STC007Line::BITS_PER_WORD] =      // T^(-6) matrix (H-mirrored).
{
    0x0040, 0x0080, 0x0101, 0x0202, 0x0404, 0x0808, 0x1010, 0x2020, 0x0001, 0x0002, 0x0004, 0x0008, 0x0010, 0x0020
};
static const uint16_t TP1IN1_MATRIX[STC007Line::BITS_PER_WORD] =   // (T^1+I)^(-1) matrix (H-mirrored).
{
    0x3FFE, 0x3FFC, 0x3FF8, 0x3FF0, 0x3FE0, 0x3FC0, 0x3F80, 0x3F00, 0x01FF, 0x03FF, 0x07FF, 0x0FFF, 0x1FFF, 0x3FFF
};
static const uint16_t TP2IN1_MATRIX[STC007Line::BITS_PER_WORD] =   // (T^2+I)^(-1) matrix (H-mirrored).
{
    0x1554, 0x2AA8, 0x1550, 0x2AA0, 0x1540, 0x2A80, 0x1500, 0x2A00, 0x0155, 0x02AA, 0x0555, 0x0AAA, 0x1555, 0x2AAA
};
static const uint16_t TP3IN1_MATRIX[STC007Line::BITS_PER_WORD] =   // (T^3+I)^(-1) matrix (H-mirrored).
{
    0x1248, 0x2490, 0x0920, 0x1240, 0x2480, 0x0900, 0x1200, 0x2400, 0x1A49, 0x3492, 0x2924, 0x1249, 0x2492, 0x0924
};
static const uint16_t TP4IN1_MATRIX[STC007Line::BITS_PER_WORD] =   // (T^4+I)^(-1) matrix (H-mirrored).
{
    0x0445, 0x088A, 0x1115, 0x222A, 0x0455, 0x08AA, 0x1155, 0x22AA, 0x0111, 0x0222, 0x0444, 0x0888, 0x1111, 0x2222
};
static const uint16_t TP5IN1_MATRIX[STC007Line::BITS_PER_WORD] =   // (T^5+I)^(-1) matrix (H-mirrored).
{
    0x1AD7, 0x35AF, 0x2B5E, 0x16BD, 0x2D7B, 0x1AF7, 0x35EF, 0x2BDE, 0x0D6B, 0x1AD6, 0x35AD, 0x2B5A, 0x16B5, 0x2D6B
};

STC007Deinterleaver::STC007Deinterleaver()
{
    this->clear();
}

//------------------------ Reset all fields to default.
void STC007Deinterleaver::clear()
{
    input_vector = NULL;
    input_deque = NULL;
    out_data_block = NULL;
    log_level = 0;
    data_res_mode = RES_MODE_14BIT_AUTO;
    ignore_crc = false;
    force_parity_check = false;
    en_p_code = true;
    en_q_code = true;
    en_cwd = false;
    proc_state = STG_ERROR_CHECK;
}

//------------------------ Set debug logging level (LOG_PROCESS, etc...).
void STC007Deinterleaver::setLogLevel(uint8_t in_level)
{
    log_level = in_level;
}

//------------------------ Set input deque pointer.
void STC007Deinterleaver::setInput(std::deque<STC007Line> *in_line_buffer)
{
    input_deque = in_line_buffer;
    if(input_deque!=NULL)
    {
        // Remove pointer to vector.
        input_vector = NULL;
    }
}

//------------------------ Set input vector pointer.
void STC007Deinterleaver::setInput(std::vector<STC007Line> *in_line_buffer)
{
    input_vector = in_line_buffer;
    if(input_vector!=NULL)
    {
        // Remove pointer to deque.
        input_deque = NULL;
    }
}

//------------------------ Set output data block.
void STC007Deinterleaver::setOutput(STC007DataBlock *out_data)
{
    out_data_block = out_data;
}

//------------------------ Set resolution detection algorythm (14-bit EIAJ/16-bit PCM-F1).
void STC007Deinterleaver::setResMode(uint8_t in_resolution)
{
    if(in_resolution<RES_MODE_MAX)
    {
#ifdef DI_EN_DBG_OUT
        if(data_res_mode!=in_resolution)
        {
            if((log_level&LOG_SETTINGS)!=0)
            {
                if(in_resolution==RES_MODE_14BIT)
                {
                    qInfo()<<"[DI-007] Resolution mode set to '14-bit strict'.";
                }
                else if(in_resolution==RES_MODE_14BIT_AUTO)
                {
                    qInfo()<<"[DI-007] Resolution mode set to '14-bit auto'.";
                }
                else if(in_resolution==RES_MODE_16BIT_AUTO)
                {
                    qInfo()<<"[DI-007] Resolution mode set to '16-bit auto'.";
                }
                else
                {
                    qInfo()<<"[DI-007] Resolution mode set to '16-bit strict'.";
                }
            }
        }
#endif
        data_res_mode = in_resolution;
    }
}

//------------------------ Enable/disable ignoring CRC in video lines.
void STC007Deinterleaver::setIgnoreCRC(bool flag)
{
#ifdef DI_EN_DBG_OUT
    if(ignore_crc!=flag)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(flag==false)
            {
                qInfo()<<"[DI-007] CRC discarding set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[DI-007] CRC discarding set to 'enabled'.";
            }
        }
    }
#endif
    ignore_crc = flag;
}

//------------------------ Enable/disable force parity check (regardless of CRC result).
void STC007Deinterleaver::setForceParity(bool flag)
{
#ifdef DI_EN_DBG_OUT
    if(force_parity_check!=flag)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(flag==false)
            {
                qInfo()<<"[DI-007] Parity check override set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[DI-007] Parity check override set to 'enabled'.";
            }
        }
    }
#endif
    force_parity_check = flag;
}

//------------------------ Enable/disable P-code correction of data.
void STC007Deinterleaver::setPCorrection(bool flag)
{
#ifdef DI_EN_DBG_OUT
    if(en_p_code!=flag)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(flag==false)
            {
                qInfo()<<"[DI-007] P-code error correction set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[DI-007] P-code error correction set to 'enabled'.";
            }
        }
    }
#endif
    en_p_code = flag;
    if(en_p_code==false)
    {
        setQCorrection(false);
        setCWDCorrection(false);
    }
}

//------------------------ Enable/disable Q-code correction of data.
void STC007Deinterleaver::setQCorrection(bool flag)
{
#ifdef DI_EN_DBG_OUT
    if(en_q_code!=flag)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(flag==false)
            {
                qInfo()<<"[DI-007] Q-code error correction set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[DI-007] Q-code error correction set to 'enabled'.";
            }
        }
    }
#endif
    en_q_code = flag;
    if(en_q_code!=false)
    {
        setPCorrection(true);
    }
}

