Fagear/SDVPCMdecoder/stc007deinterleaver.cpp
//------------------------ Enable/disable CWD correction of data.
void STC007Deinterleaver::setCWDCorrection(bool flag)
{
#ifdef DI_EN_DBG_OUT
    if(en_cwd!=flag)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(flag==false)
            {
                qInfo()<<"[DI-007] CWD error correction set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[DI-007] CWD error correction set to 'enabled'.";
            }
        }
    }
#endif
    en_cwd = flag;
}

//------------------------ Take buffer of binarized PCM lines, perform deinterleaving,
//------------------------ check for errors and correct those if possible.
uint8_t STC007Deinterleaver::processBlock(uint16_t line_shift)
{
    bool use_vector, suppress_log;
    uint8_t run_audio_res, stage_count, fill_passes, all_crc_errs, aud_crc_errs, first_bad, second_bad, fix_result;

    use_vector = false;

    // Check pointers.
    if(out_data_block==NULL)
    {
#ifdef DI_EN_DBG_OUT
        qWarning()<<DBG_ANCHOR<<"[DI-007] Null input pointer for STC-007 data block provided, exiting...";
#endif
        return DI_RET_NULL_BLOCK;
    }
    if(input_deque==NULL)
    {
        if(input_vector==NULL)
        {
#ifdef DI_EN_DBG_OUT
            qWarning()<<DBG_ANCHOR<<"[DI-007] Null output pointer for STC-007 line buffer provided, exiting...";
#endif
            return DI_RET_NULL_LINES;
        }
        else
        {
            use_vector = true;
            // Check if there is enough data to process.
            if((input_vector->size())<=(size_t)(STC007DataBlock::MIN_DEINT_DATA+line_shift))
            {
#ifdef DI_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[DI-007] Not enough STC-007 lines in buffer:"<<input_vector->size()<<", required:"<<(STC007DataBlock::MIN_DEINT_DATA+line_shift+1);
                }
#endif
                return DI_RET_NO_DATA;
            }
        }
    }
    else
    {
        // Check if there is enough data to process.
        if((input_deque->size())<=(size_t)(STC007DataBlock::MIN_DEINT_DATA+line_shift))
        {
#ifdef DI_EN_DBG_OUT
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[DI-007] Not enough STC-007 lines in buffer:"<<input_deque->size()<<", required:"<<(STC007DataBlock::MIN_DEINT_DATA+line_shift+1);
            }
#endif
            return DI_RET_NO_DATA;
        }
    }

    // Measure processing time for debuging.
#ifdef QT_VERSION
    QElapsedTimer time_per_block;
    time_per_block.start();
#endif

    suppress_log = !(((log_level&LOG_PROCESS)!=0)||((log_level&LOG_ERROR_CORR)!=0));

    // Set primary audio resolution and try count.
    if(data_res_mode==RES_MODE_14BIT)
    {
        // 14 bit strict.
        run_audio_res = STC007DataBlock::RES_14BIT;
        // Allow only one pass.
        fill_passes = MAX_PASSES;
    }
    else if(data_res_mode==RES_MODE_14BIT_AUTO)
    {
        // 14 bit loose, start from 14-bit mode.
        run_audio_res = STC007DataBlock::RES_14BIT;
        // Allow 14-16-14 bit passes to determine what's best.
        fill_passes = 0;
    }
    else if(data_res_mode==RES_MODE_16BIT_AUTO)
    {
        // 16 bit loose, start from 16-bit mode.
        run_audio_res = STC007DataBlock::RES_16BIT;
        // Allow 16-14-16 bit passes to determine what's best.
        fill_passes = 0;
    }
    else
    {
        // 16 bit strict.
        run_audio_res = STC007DataBlock::RES_16BIT;
        // Allow only one pass.
        fill_passes = MAX_PASSES;
    }

    // Preset "no index" value for error locators.
    first_bad = second_bad = NO_ERR_INDEX;
    all_crc_errs = aud_crc_errs = 0;
    proc_state = STG_DATA_FILL;

    // Cycle through stages.
    stage_count = 0;
    do
    {
        // Count loops.
        stage_count++;

/*#ifdef DI_EN_DBG_OUT
        if((log_level&LOG_PROCESS)!=0)
        {
            qInfo()<<"[DI-007] Stage"<<proc_state<<QString::fromStdString(out_data_block->dumpContentString());
        }
#endif*/

        //qDebug()<<"[DI-007] State #"<<proc_state<<", stage"<<stage_count;

        // Select processing mode.
        if(proc_state==STG_DATA_FILL)
        {
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                if(run_audio_res==STC007DataBlock::RES_16BIT)
                {
                    qInfo()<<"[DI-007] -------------------- Filling data in 16-bit mode, try"<<fill_passes;
                }
                else
                {
                    qInfo()<<"[DI-007] -------------------- Filling data in 14-bit mode, try"<<fill_passes;
                }
            }
#endif
            out_data_block->clear();
            // Fill data block with words from interleaved PCM-lines.
            if(use_vector==false)
            {
                setWordData(&((*input_deque)[STC007DataBlock::LINE_L0+line_shift]), &((*input_deque)[STC007DataBlock::LINE_R0+line_shift]),
                            &((*input_deque)[STC007DataBlock::LINE_L1+line_shift]), &((*input_deque)[STC007DataBlock::LINE_R1+line_shift]),
                            &((*input_deque)[STC007DataBlock::LINE_L2+line_shift]), &((*input_deque)[STC007DataBlock::LINE_R2+line_shift]),
                            &((*input_deque)[STC007DataBlock::LINE_P0+line_shift]), &((*input_deque)[STC007DataBlock::LINE_Q0+line_shift]),
                            out_data_block, run_audio_res);
            }
            else
            {
                setWordData(&((*input_vector)[STC007DataBlock::LINE_L0+line_shift]), &((*input_vector)[STC007DataBlock::LINE_R0+line_shift]),
                            &((*input_vector)[STC007DataBlock::LINE_L1+line_shift]), &((*input_vector)[STC007DataBlock::LINE_R1+line_shift]),
                            &((*input_vector)[STC007DataBlock::LINE_L2+line_shift]), &((*input_vector)[STC007DataBlock::LINE_R2+line_shift]),
                            &((*input_vector)[STC007DataBlock::LINE_P0+line_shift]), &((*input_vector)[STC007DataBlock::LINE_Q0+line_shift]),
                            out_data_block, run_audio_res);
            }
            // Reset audio state.
            out_data_block->markAsOriginalData();
            // Count number of fills.
            fill_passes++;
#ifdef DI_EN_DBG_OUT
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[DI-007] Fill:"<<QString::fromStdString(out_data_block->dumpContentString());
            }
#endif
            // Go check CRC.
            proc_state = STG_ERROR_CHECK;
        }
        else if(proc_state==STG_ERROR_CHECK)
        {
            // Preset "no index" value for error locators.
            first_bad = NO_ERR_INDEX;
            second_bad = NO_ERR_INDEX;
            // Reset "bad samples" counter.
            all_crc_errs = aud_crc_errs = 0;

            // Search for audio samples with bad CRC.
            for(uint8_t index=STC007DataBlock::WORD_L0;index<=STC007DataBlock::WORD_R2;index++)
            {
                if(out_data_block->isWordLineCRCOk(index)==false)
                {
                    // Count number of errors in audio samples.
                    if(first_bad==NO_ERR_INDEX)
                    {
                        // Save index of first error in audio data.
                        first_bad = index;
                    }
                    else if(second_bad==NO_ERR_INDEX)
                    {
                        // Save index of second error in audio data.
                        second_bad = index;
                        break;
                    }
                }
            }
            // Get number of words with bad CRC.
            aud_crc_errs = out_data_block->getErrorsAudioSource();
            all_crc_errs = out_data_block->getErrorsTotalSource();
            proc_state = STG_TASK_SELECTION;
        }
        else if(proc_state==STG_TASK_SELECTION)
        {
            // Preset bad result.
            proc_state = STG_BAD_BLOCK;

            // Check number of bad words.
            if(all_crc_errs<=2)
            {
                // 2 or less errors, that can be handled by P and Q correction.
                if(aud_crc_errs==0)
                {
                    // No audio CRC errors in the data block.
                    if(force_parity_check==false)
                    {
                        // Force parity check disabled.
                        // All audio samples are fine - data is valid.
                        // (don't care about any errors in P&Q words)
                        proc_state = STG_DATA_OK;
                    }
                    else if(en_p_code!=false)
                    {
                        // P-code correction is allowed.
                        // Override and force parity check.
                        proc_state = STG_P_CORR;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[DI-007] No audio CRC errors, but parity check is forced, checking with P-code...";
                        }
#endif
                    }
                    else
                    {
                        // Force parity check enabled, but P-code checks are disabled (assume Q-code disabled as well).
                        // Assume all audio samples are fine - data is valid.
                        // (don't care about any errors in P/Q words)
                        proc_state = STG_NO_CHECK;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[DI-007] No audio CRC errors, parity check is forced, but P-code is disabled.";
                        }
#endif
                    }
                }
                else if(aud_crc_errs==1)
                {
                    // There is one corrupted audio sample. It can be fixed with P-code (or Q-code).
                    if(en_p_code!=false)
                    {
                        // P-code correction is allowed.
                        // Go to P-code correction stage.
                        proc_state = STG_P_CORR;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[DI-007] One audio sample #"<<first_bad<<"is CRC-marked, trying to correct with P-code...";
                        }
#endif
                    }
#ifdef DI_EN_DBG_OUT
                    else
                    {
                        // P-code correction is disabled (and Q-code as well).
                        // Unable to do anything with an error.
                        // Bad state was preset at the start.
                        if(suppress_log==false)
                        {
                            qInfo()<<"[DI-007] One audio sample #"<<first_bad<<"is CRC-marked, but P-code is disabled, unable to fix an error!";
                        }
                    }
#endif
                }
                else if(aud_crc_errs==2)
                {
                    // There are two corrupted audio samples.
                    if(run_audio_res==STC007DataBlock::RES_14BIT)
                    {
                        // 14-bit mode (STC-007/STC-008).
                        if(en_q_code!=false)
                        {
                            // Q-code correction is allowed.
                            // Go to Q-code correction stage.
                            proc_state = STG_Q_CORR;
#ifdef DI_EN_DBG_OUT
                            if(suppress_log==false)
                            {
                                qInfo()<<"[DI-007] Two audio samples are CRC-marked, trying to correct with Q-code...";
                            }
#endif
                        }
#ifdef DI_EN_DBG_OUT
                        else
                        {
                            // Q-code correction is disabled.
                            // Unable to do anything with an error.
                            // Bad state was preset at the start.
                            if(suppress_log==false)
                            {
                                qInfo()<<"[DI-007] Two audio samples are CRC-marked, but Q-code is disabled, unable to fix errors!";
                            }
                        }
#endif
                    }
                    else
                    {
                        // 16-bit mode (PCM-F1).
                        // There is no Q-code available in 16-bit mode.
                        if((en_cwd!=false)&&(out_data_block->isDataFixedByCWD()==false))
                        {
                            // Try to apply data from CWD.
                            proc_state = STG_CWD_CORR;
#ifdef DI_EN_DBG_OUT
                            if(suppress_log==false)
                            {
                                qInfo()<<"[DI-007] Two audio samples are CRC-marked, no Q-code (16-bit mode), trying CWD...";
                            }
#endif
                        }
#ifdef DI_EN_DBG_OUT
                        else
                        {
                            // No fix.
                            if(suppress_log==false)
                            {
                                qInfo()<<"[DI-007] Two audio samples are CRC-marked, no Q-code (16-bit mode), unable to fix the data!";
                            }
                        }
#endif
                    }
                }
            }
            else
            {
                // More than two corrupted words.
                // It can not be restored to original state by default corrections.
                if((en_cwd!=false)&&(out_data_block->cwd_applied==false))
                {
                    // Try to apply data from CWD.
                    proc_state = STG_CWD_CORR;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] More than two samples are CRC-marked, trying CWD...";
                    }
#endif
                }
#ifdef DI_EN_DBG_OUT
                else
                {
                    // Dropout detected.
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] More than two words are CRC-marked, that can not be corrected!";
                    }
                }
#endif
            }
        }
        else if(proc_state==STG_CWD_CORR)
        {
            // Try to "fix" data with Cross-Word Decoding if pre-deinterleave was performed.
            uint8_t fix_count;
            fix_count = 0;
            // Preset bad result.
            proc_state = STG_BAD_BLOCK;
            // Scan words for already pre-fixed words during pre-scan.
            for(uint8_t index=STC007DataBlock::WORD_L0;index<=STC007DataBlock::WORD_Q0;index++)
            {
                if((out_data_block->isWordCWDFixed(index)!=false)/*&&(out_data_block->isWordValid(index)==false)*/)
                {
                    // Data word has flag that this word was fixed in pre-scan.
                    out_data_block->setFixed(index);
                    out_data_block->markAsFixedByCWD();
                    fix_count++;

                    // DEBUG
                    //suppress_log = false;

