Fagear/SDVPCMdecoder/stc007deinterleaver.cpp
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] Sample #"<<index<<"is fixed during CWD pre-scan, updating valid flag...";
                    }
#endif
                }
            }
            // Check number of CWD corrections.
            if(fix_count!=0)
            {
                // Reset "bad samples" counter.
                first_bad = second_bad = NO_ERR_INDEX;
                all_crc_errs = aud_crc_errs = 0;
                // Search for audio samples with bad CRC.
                for(uint8_t index=STC007DataBlock::WORD_L0;index<=STC007DataBlock::WORD_Q0;index++)
                {
                    if(out_data_block->isWordValid(index)==false)
                    {
                        // Calculate number of words that still have errors.
                        all_crc_errs++;
                    }
                    if(index<=STC007DataBlock::WORD_R2)
                    {
                        if(out_data_block->isWordValid(index)==false)
                        {
                            // Count number of errors in audio samples.
                            aud_crc_errs++;
                            if(first_bad==NO_ERR_INDEX)
                            {
                                // Save index of first error in audio data.
                                first_bad = index;
                            }
                            else if(second_bad==NO_ERR_INDEX)
                            {
                                // Save index of second error in audio data.
                                second_bad = index;
                            }
                        }
                    }
                }
                // Repeat process.
                proc_state = STG_TASK_SELECTION;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007]"<<fix_count<<"samples fixed with CWD, retrying standard ECC...";
                }
#endif
            }
#ifdef DI_EN_DBG_OUT
            else
            {
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Cross-Word Decoding didn't help, unable to fix errors!";
                }
            }
#endif
        }
        else if(proc_state==STG_P_CORR)
        {
            // Try to check parity with with P-code.
            // Preset bad result.
            proc_state = STG_BAD_BLOCK;
            // Check if P-word is not damaged.
            if(out_data_block->isWordValid(STC007DataBlock::WORD_P0)!=false)
            {
                // Fix audio sample with parity if required (audio resolution is already preset).
                fix_result = fixByP(out_data_block, first_bad);
                if(fix_result==FIX_BROKEN)
                {
                    // Audio data is BROKEN.
                    // Bad state was preset at the start.
                    out_data_block->markAsBroken();
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] Broken data detected!";
                    }
#endif
                }
                else
                {
                    // Audio is not BROKEN (yet).
                    proc_state = STG_DATA_OK;
                    // Clear "fixed by CWD" flag if present.
                    out_data_block->clearWordFixedByCWD(first_bad);
                    if(fix_result==FIX_DONE)
                    {
                        // Audio data is fixed with P-code.
                        out_data_block->markAsFixedByP();
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[DI-007] Successfully fixed the error with P-code";
                        }
#endif
                    }
                    else if(fix_result==FIX_NOT_NEED)
                    {
                        // There was no actual error at the pointer.
                        if(first_bad<STC007DataBlock::WORD_P0)
                        {
                            // Mark data block as fixed by P-code if it was not just forced check.
                            out_data_block->markAsFixedByP();
                        }
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[DI-007] No P-code error detected";
                        }
#endif
                    }
                    // Check if resolution set to 14-bit and Q-code is available.
                    if((run_audio_res==STC007DataBlock::RES_14BIT)&&                            // Audio resolution is 14-bit, Q-code present.
                       (en_q_code!=false))                                                      // Usage of Q-code is allowed.
                    {
                        // Check if Q-word is valid.
                        if(out_data_block->isWordValid(STC007DataBlock::WORD_Q0)!=false)
                        {
                            // Check if force check is required.
                            if(force_parity_check!=false)                                       // Forced check is enabled.
                            {
                                uint16_t synd_q;
                                // Calculate syndrome for Q-code (all audio words and P-code are intact as check showed).
                                synd_q = calcSyndromeQ(out_data_block);
                                if(synd_q!=0)
                                {
#ifdef DI_EN_DBG_OUT
                                    if(suppress_log==false)
                                    {
                                        qInfo()<<"[DI-007] But Q-code check resulted in error! Broken data detected!";
                                    }
#endif
                                    // Broken data by Q-code.
                                    proc_state = STG_BAD_BLOCK;
                                    out_data_block->markAsBroken();
                                }
#ifdef DI_EN_DBG_OUT
                                else
                                {
                                    if(suppress_log==false)
                                    {
                                        qInfo()<<"[DI-007] No Q-code error detected";
                                    }
                                }
#endif
                            }
                        }
                        else
                        {
                            // Q-code is damaged, fix it as well as soon as all other samples are fine.
                            uint16_t q_code;
                            q_code = calcQcode(out_data_block);
                            if(out_data_block->getWord(STC007DataBlock::WORD_Q0)!=q_code)
                            {
#ifdef DI_EN_DBG_OUT
                                if(suppress_log==false)
                                {
                                    QString log_line;
                                    log_line.sprintf("[DI-007] Q-word is damaged, patching it: [0x%04x]->[0x%04x]",
                                                     out_data_block->getWord(STC007DataBlock::WORD_Q0), q_code);
                                    qInfo()<<log_line;
                                }
#endif
                                // Store new Q-word.
                                out_data_block->setWord(STC007DataBlock::WORD_Q0, q_code, out_data_block->isWordLineCRCOk(STC007DataBlock::WORD_Q0), false);
                                // Mark Q-word as fixed.
                                out_data_block->setFixed(STC007DataBlock::WORD_Q0);
                            }
                            else
                            {
                                // Mark Q-word as valid.
                                out_data_block->setValid(STC007DataBlock::WORD_Q0);
#ifdef DI_EN_DBG_OUT
                                if(suppress_log==false)
                                {
                                    qInfo()<<"[DI-007] Q-word doesn't need fixing, updated to be valid";
                                }
#endif
                            }
                        }
                    }
                }
            }
            else
            {
                // Can not check parity because P-code word itself is damaged.
                if(run_audio_res==STC007DataBlock::RES_14BIT)
                {
                    // Q-code is available (14-bit mode).
                    if(en_q_code!=false)
                    {
                        // Q-code correction is allowed.
                        // Switch to Q-code mode.
                        proc_state = STG_Q_CORR;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[DI-007] P-code word is bad, switching to Q-code check";
                        }
#endif
                    }
                    else
                    {
                        // Q-code correction is disabled.
                        if(aud_crc_errs==0)
                        {
                            // No CRC marks (just forced check).
                            // Can not check the data.
                            proc_state = STG_NO_CHECK;
#ifdef DI_EN_DBG_OUT
                            if(suppress_log==false)
                            {
                                qInfo()<<"[DI-007] P-code word is bad, but Q-code is disabled, unable to verify parity";
                            }
#endif
                        }
#ifdef DI_EN_DBG_OUT
                        else
                        {
                            // There is at least one audio error, P-code is also bad and Q-code is disabled.
                            // Unable to do anything with an error.
                            // Bad state was preset at the start.
                            if(suppress_log==false)
                            {
                                qInfo()<<"[DI-007] P-code word is bad, but Q-code is disabled, unable to fix an error!";
                            }
                        }
#endif
                    }
                }
                else if(aud_crc_errs==0)
                {
                    // No Q-code available (16-bit mode) and no CRC marks (just forced check).
                    // Can not check the data.
                    proc_state = STG_NO_CHECK;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] P-code word is bad, unable to verify parity";
                    }
#endif
                }
#ifdef DI_EN_DBG_OUT
                else
                {
                    // No Q-code (16-bit mode) and one audio CRC mark, but bad P-code.
                    // Data can not be corrected.
                    // Bad state was preset at the start.
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] P-code word is bad, no Q-code, can not fix the data";
                    }
                }
#endif
            }
        }
        else if(proc_state==STG_Q_CORR)
        {
            // Preset bad result.
            proc_state = STG_BAD_BLOCK;
            // Try to correct errors with Q-code (only for 14-bit mode).
            if(out_data_block->isWordValid(STC007DataBlock::WORD_Q0)!=false)
            {
                // Fix two samples with Q and P codes.
                fix_result = fixByQ(out_data_block, first_bad, second_bad);
                // Workaround for Q-fix for P-code.
                // Error markers point only on audio samples.
                // Set second marker on P-code for CWD marking if needed.
                if(out_data_block->isWordLineCRCOk(STC007DataBlock::WORD_P0)==false)
                {
                    second_bad = STC007DataBlock::WORD_P0;
                }
                if(fix_result==FIX_DONE)
                {
                    // Audio data is corrected.
                    proc_state = STG_DATA_OK;
                    // Clear "fixed by CWD" flags if present.
                    out_data_block->clearWordFixedByCWD(first_bad);
                    out_data_block->clearWordFixedByCWD(second_bad);
                    // Mark data block as fixed by Q-code.
                    out_data_block->markAsFixedByQ();
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] Successfully fixed errors with Q-code";
                    }
#endif
                }
                else if(fix_result==FIX_NOT_NEED)
                {
                    // No actual errors at pointers, data is ok.
                    proc_state = STG_DATA_OK;
                    // Clear "fixed by CWD" flags if present.
                    out_data_block->clearWordFixedByCWD(first_bad);
                    out_data_block->clearWordFixedByCWD(second_bad);
                    if(first_bad<STC007DataBlock::WORD_P0)
                    {
                        // Mark data block as fixed by Q-code if it was not just forced check.
                        out_data_block->markAsFixedByQ();
                    }
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] ECC has not detected any errors";
                    }
#endif
                }
                else if(fix_result==FIX_SWITCH_P)
                {
                    // Need to switch to correction with P-code.
                    proc_state = STG_P_CORR;
                }
                else if(fix_result==FIX_BROKEN)
                {
                    // Audio data is broken.
                    // Bad state was preset at the start.
                    out_data_block->markAsBroken();
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] Broken data detected!";
                    }
#endif
                }
                // In other cases bad state was preset at the start.
            }
            else
            {
                // Can not check data because Q-code word is damaged.
                if(first_bad==NO_ERR_INDEX)
                {
                    // No CRC marks were provided (just forced check).
                    // Unable to check the data.
                    proc_state = STG_NO_CHECK;
                    // Re-calculate and fill in P and Q words.
                    uint16_t ecc_word;
                    ecc_word = calcPcode(out_data_block);
                    out_data_block->setWord(STC007DataBlock::WORD_P0, ecc_word, false, out_data_block->isWordCWDFixed(STC007DataBlock::WORD_P0));
                    out_data_block->setFixed(STC007DataBlock::WORD_P0);
                    ecc_word = calcQcode(out_data_block);
                    out_data_block->setWord(STC007DataBlock::WORD_Q0, ecc_word, false, out_data_block->isWordCWDFixed(STC007DataBlock::WORD_Q0));
                    out_data_block->setFixed(STC007DataBlock::WORD_Q0);
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] Q-code word is bad, unable to check audio data, re-calculated P and Q";
                    }
#endif
                }
#ifdef DI_EN_DBG_OUT
                else
                {
                    // CRC marks are present.
                    // No hope here.
                    // Bad state was preset at the start.
                    if(suppress_log==false)
                    {
                        qInfo()<<"[DI-007] Q-code word is bad, can not fix the errors";
                    }
                }
#endif
            }
        }
        else if(proc_state==STG_BAD_BLOCK)
        {
            // Errors in audio samples can not be fixed.
            out_data_block->clearFixedByCWD();
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[DI-007] Audio data can not be fixed, dropout detected!";
            }
#endif
            if(fill_passes>=MAX_PASSES)
            {
                // Exit stage cycle.
                break;
            }
            else
            {
                // Try to switch audio resolution and fill again.
                if(run_audio_res==STC007DataBlock::RES_16BIT)
                {
                    run_audio_res = STC007DataBlock::RES_14BIT;
                }
                else
                {
                    run_audio_res = STC007DataBlock::RES_16BIT;
                }
                proc_state = STG_DATA_FILL;
            }
        }
        else if(proc_state==STG_NO_CHECK)
        {
            // No CRC errors in audio words, but unable to force-check integrity due to bad P/Q-code.
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[DI-007] Audio samples are not damaged but can not be verified!";
            }
#endif
            // Exit stage cycle.
            break;
        }
        else if(proc_state==STG_DATA_OK)
        {
            // Audio samples are intact.
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[DI-007] All audio samples are good";
                if(out_data_block->isDataFixedByCWD()!=false)
                {
                    qInfo()<<"[DI-007] Fixed by CWD";
                }
            }
#endif
            // Exit stage cycle.
            break;
        }
        else
        {
#ifdef QT_VERSION
            qWarning()<<DBG_ANCHOR<<"[DI-007] Impossible state detected, breaking...";
#endif
            // Exit stage cycle.
            break;
        }

        // Check for looping.
        if(stage_count>(STG_CONVERT_MAX*MAX_PASSES))
        {
#ifdef QT_VERSION
            qWarning()<<DBG_ANCHOR<<"[DI-007] Inf. loop detected, breaking...";
#endif
            // Exit stage cycle.
            break;
        }
    }
    while(1);   // Stages cycle.

#ifdef DI_EN_DBG_OUT
    if((log_level&LOG_PROCESS)!=0)
    {
        qInfo()<<"[DI-007] After:"<<QString::fromStdString(out_data_block->dumpContentString());
    }
#endif

    // Store time that processing took.
    quint64 block_time;
    block_time = 0;
#ifdef QT_VERSION
    block_time = time_per_block.nsecsElapsed();
#endif
    out_data_block->process_time = (uint32_t)(block_time/1000);

