Fagear/SDVPCMdecoder/stc007deinterleaver.cpp
    return DI_RET_OK;
}

//---------------------- Set data and CRC state for all words in the data block.
void STC007Deinterleaver::setWordData(STC007Line *line_L0, STC007Line *line_R0,
                                      STC007Line *line_L1, STC007Line *line_R1,
                                      STC007Line *line_L2, STC007Line *line_R2,
                                      STC007Line *line_P0, STC007Line *line_Q0,
                                      STC007DataBlock *out_data_block,
                                      uint8_t in_resolution)
{
    bool word1_crc_ok, word2_crc_ok, word3_crc_ok, word4_crc_ok, word5_crc_ok, word6_crc_ok, word7_crc_ok, word8_crc_ok;
    bool sword1_crc_ok, sword2_crc_ok, sword3_crc_ok, sword4_crc_ok, sword5_crc_ok, sword6_crc_ok, sword7_crc_ok;

    // Check if CRC should be ignored.

    word1_crc_ok = word2_crc_ok = word3_crc_ok = word4_crc_ok = word5_crc_ok = word6_crc_ok = word7_crc_ok = word8_crc_ok = true;
    if(ignore_crc==false)
    {
        // Take CRC states for the words.
        word1_crc_ok = line_L0->isWordCRCOk(STC007Line::WORD_L_SH0);
        word2_crc_ok = line_R0->isWordCRCOk(STC007Line::WORD_R_SH48);
        word3_crc_ok = line_L1->isWordCRCOk(STC007Line::WORD_L_SH95);
        word4_crc_ok = line_R1->isWordCRCOk(STC007Line::WORD_R_SH143);
        word5_crc_ok = line_L2->isWordCRCOk(STC007Line::WORD_L_SH190);
        word6_crc_ok = line_R2->isWordCRCOk(STC007Line::WORD_R_SH238);
        word7_crc_ok = line_P0->isWordCRCOk(STC007Line::WORD_P_SH288);
        word8_crc_ok = line_Q0->isWordCRCOk(STC007Line::WORD_Q_SH336);
    }

    // Check provided resolution.
    if(in_resolution==STC007DataBlock::RES_14BIT)
    {
        // 14-bit mode (STC-007).
        // Copy L0.
        out_data_block->setWord(STC007DataBlock::WORD_L0, line_L0->getWord(STC007Line::WORD_L_SH0), word1_crc_ok, line_L0->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_L0, line_L0->frame_number, line_L0->line_number);
        // Copy R0.
        out_data_block->setWord(STC007DataBlock::WORD_R0, line_R0->getWord(STC007Line::WORD_R_SH48), word2_crc_ok, line_R0->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_R0, line_R0->frame_number, line_R0->line_number);
        // Copy L1.
        out_data_block->setWord(STC007DataBlock::WORD_L1, line_L1->getWord(STC007Line::WORD_L_SH95), word3_crc_ok, line_L1->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_L1, line_L1->frame_number, line_L1->line_number);
        // Copy R1.
        out_data_block->setWord(STC007DataBlock::WORD_R1, line_R1->getWord(STC007Line::WORD_R_SH143), word4_crc_ok, line_R1->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_R1, line_R1->frame_number, line_R1->line_number);
        // Copy L2.
        out_data_block->setWord(STC007DataBlock::WORD_L2, line_L2->getWord(STC007Line::WORD_L_SH190), word5_crc_ok, line_L2->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_L2, line_L2->frame_number, line_L2->line_number);
        // Copy R2.
        out_data_block->setWord(STC007DataBlock::WORD_R2, line_R2->getWord(STC007Line::WORD_R_SH238), word6_crc_ok, line_R2->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_R2, line_R2->frame_number, line_R2->line_number);
        // Copy P0.
        out_data_block->setWord(STC007DataBlock::WORD_P0, line_P0->getWord(STC007Line::WORD_P_SH288), word7_crc_ok, line_P0->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_P0, line_P0->frame_number, line_P0->line_number);
        // Copy Q0.
        out_data_block->setWord(STC007DataBlock::WORD_Q0, line_Q0->getWord(STC007Line::WORD_Q_SH336), word8_crc_ok, line_Q0->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_Q0, line_Q0->frame_number, line_Q0->line_number);
    }
    else
    {
        // 16-bit mode (PCM-F1).
        bool word_valid;
        uint16_t s_word, f1_word;

        sword1_crc_ok = sword2_crc_ok = sword3_crc_ok = sword4_crc_ok = sword5_crc_ok = sword6_crc_ok = sword7_crc_ok = true;
        // Check if CRC should be ignored.
        if(ignore_crc==false)
        {
            // Take CRC states for the Q/S-words.
            sword1_crc_ok = line_L0->isWordCRCOk(STC007Line::WORD_Q_SH336);
            sword2_crc_ok = line_R0->isWordCRCOk(STC007Line::WORD_Q_SH336);
            sword3_crc_ok = line_L1->isWordCRCOk(STC007Line::WORD_Q_SH336);
            sword4_crc_ok = line_R1->isWordCRCOk(STC007Line::WORD_Q_SH336);
            sword5_crc_ok = line_L2->isWordCRCOk(STC007Line::WORD_Q_SH336);
            sword6_crc_ok = line_R2->isWordCRCOk(STC007Line::WORD_Q_SH336);
            sword7_crc_ok = line_P0->isWordCRCOk(STC007Line::WORD_Q_SH336);
        }

        // Copy L0.
        // Copy data from interleaved lines while adding two LSB's from S-words.
        f1_word = (line_L0->getWord(STC007Line::WORD_L_SH0)<<STC007DataBlock::F1_WORD_OFS);     // Move 14-bit word towards MSBs,
        s_word = (line_L0->getWord(STC007Line::WORD_Q_SH336)>>STC007DataBlock::F1_S_L0_OFS)&STC007DataBlock::F1_S_MASK;     // Add 2 LSB bits from S-word in the same line.
        // Calculate CRC validity from two words in the same line.
        word_valid = (word1_crc_ok&sword1_crc_ok);
        out_data_block->setWord(STC007DataBlock::WORD_L0, (f1_word+s_word), word_valid, line_L0->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_L0, line_L0->frame_number, line_L0->line_number);
        // Copy R0.
        f1_word = (line_R0->getWord(STC007Line::WORD_R_SH48)<<STC007DataBlock::F1_WORD_OFS);
        s_word = (line_R0->getWord(STC007Line::WORD_Q_SH336)>>STC007DataBlock::F1_S_R0_OFS)&STC007DataBlock::F1_S_MASK;
        word_valid = (word2_crc_ok&sword2_crc_ok);
        out_data_block->setWord(STC007DataBlock::WORD_R0, (f1_word+s_word), word_valid, line_R0->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_R0, line_R0->frame_number, line_R0->line_number);
        // Copy L1.
        f1_word = (line_L1->getWord(STC007Line::WORD_L_SH95)<<STC007DataBlock::F1_WORD_OFS);
        s_word = (line_L1->getWord(STC007Line::WORD_Q_SH336)>>STC007DataBlock::F1_S_L1_OFS)&STC007DataBlock::F1_S_MASK;
        word_valid = (word3_crc_ok&sword3_crc_ok);
        out_data_block->setWord(STC007DataBlock::WORD_L1, (f1_word+s_word), word_valid, line_L1->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_L1, line_L1->frame_number, line_L1->line_number);
        // Copy R1.
        f1_word = (line_R1->getWord(STC007Line::WORD_R_SH143)<<STC007DataBlock::F1_WORD_OFS);
        s_word = (line_R1->getWord(STC007Line::WORD_Q_SH336)>>STC007DataBlock::F1_S_R1_OFS)&STC007DataBlock::F1_S_MASK;
        word_valid = (word4_crc_ok&sword4_crc_ok);
        out_data_block->setWord(STC007DataBlock::WORD_R1, (f1_word+s_word), word_valid, line_R1->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_R1, line_R1->frame_number, line_R1->line_number);
        // Copy L2.
        f1_word = (line_L2->getWord(STC007Line::WORD_L_SH190)<<STC007DataBlock::F1_WORD_OFS);
        s_word = (line_L2->getWord(STC007Line::WORD_Q_SH336)>>STC007DataBlock::F1_S_L2_OFS)&STC007DataBlock::F1_S_MASK;
        word_valid = (word5_crc_ok&sword5_crc_ok);
        out_data_block->setWord(STC007DataBlock::WORD_L2, (f1_word+s_word), word_valid, line_L2->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_L2, line_L2->frame_number, line_L2->line_number);
        // Copy R2.
        f1_word = (line_R2->getWord(STC007Line::WORD_R_SH238)<<STC007DataBlock::F1_WORD_OFS);
        s_word = (line_R2->getWord(STC007Line::WORD_Q_SH336)>>STC007DataBlock::F1_S_R2_OFS)&STC007DataBlock::F1_S_MASK;
        word_valid = (word6_crc_ok&sword6_crc_ok);
        out_data_block->setWord(STC007DataBlock::WORD_R2, (f1_word+s_word), word_valid, line_R2->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_R2, line_R2->frame_number, line_R2->line_number);
        // Copy P0.
        f1_word = (line_P0->getWord(STC007Line::WORD_P_SH288)<<STC007DataBlock::F1_WORD_OFS);
        s_word = (line_P0->getWord(STC007Line::WORD_Q_SH336)>>STC007DataBlock::F1_S_P0_OFS)&STC007DataBlock::F1_S_MASK;
        word_valid = (word7_crc_ok&sword7_crc_ok);
        out_data_block->setWord(STC007DataBlock::WORD_P0, (f1_word+s_word), word_valid, line_P0->isFixedByCWD());
        out_data_block->setSource(STC007DataBlock::WORD_P0, line_P0->frame_number, line_P0->line_number);
        // Zero out unused Q-word in data block structure (Q/S word is spread into 16-bit PCM words), so it will not count as damaged.
        out_data_block->setWord(STC007DataBlock::WORD_Q0, 0, true, false);
        out_data_block->setSource(STC007DataBlock::WORD_Q0, line_Q0->frame_number, line_Q0->line_number);
    }
    // Set samples resolution.
    out_data_block->setResolution(in_resolution);
#ifdef DI_EN_DBG_OUT
    if((log_level&LOG_ERROR_CORR)!=0)
    {
        QString log_line;
        log_line.sprintf("[DI-007] Added data from lines [%03u-%03u][%u|%u]-%03u[%u|%u]-%03u[%u|%u]-%03u[%u|%u]-%03u[%u|%u]-%03u[%u|%u]-%03u[%u|%u]-[%03u-%03u][%u|%u]",
                         line_L0->frame_number, line_L0->line_number, line_L0->isCRCValid(), line_L0->isFixedByCWD(),
                         line_R0->line_number, line_R0->isCRCValid(), line_R0->isFixedByCWD(),
                         line_L1->line_number, line_L1->isCRCValid(), line_L1->isFixedByCWD(),
                         line_R1->line_number, line_R1->isCRCValid(), line_R1->isFixedByCWD(),
                         line_L2->line_number, line_L2->isCRCValid(), line_L2->isFixedByCWD(),
                         line_R2->line_number, line_R2->isCRCValid(), line_R2->isFixedByCWD(),
                         line_P0->line_number, line_P0->isCRCValid(), line_P0->isFixedByCWD(),
                         line_Q0->frame_number, line_Q0->line_number, line_Q0->isCRCValid(), line_Q0->isFixedByCWD());
        qInfo()<<log_line;
    }
#endif
}

