Fagear/SDVPCMdecoder/stc007deinterleaver.cpp
//------------------------ Calculate P-code.
uint16_t STC007Deinterleaver::calcPcode(STC007DataBlock *data_block)
{
    uint16_t p_code;
    p_code = data_block->getWord(STC007DataBlock::WORD_L0)^data_block->getWord(STC007DataBlock::WORD_R0)^
             data_block->getWord(STC007DataBlock::WORD_L1)^data_block->getWord(STC007DataBlock::WORD_R1)^
             data_block->getWord(STC007DataBlock::WORD_L2)^data_block->getWord(STC007DataBlock::WORD_R2);
    return p_code;
}

//------------------------ Calculate Q-code.
uint16_t STC007Deinterleaver::calcQcode(STC007DataBlock *data_block)
{
    uint16_t q_code;
    q_code = multMatrix((uint16_t *)TP6_MATRIX, data_block->getWord(STC007DataBlock::WORD_L0));
    q_code = q_code^multMatrix((uint16_t *)TP5_MATRIX, data_block->getWord(STC007DataBlock::WORD_R0));
    q_code = q_code^multMatrix((uint16_t *)TP4_MATRIX, data_block->getWord(STC007DataBlock::WORD_L1));
    q_code = q_code^multMatrix((uint16_t *)TP3_MATRIX, data_block->getWord(STC007DataBlock::WORD_R1));
    q_code = q_code^multMatrix((uint16_t *)TP2_MATRIX, data_block->getWord(STC007DataBlock::WORD_L2));
    q_code = q_code^multMatrix((uint16_t *)TP1_MATRIX, data_block->getWord(STC007DataBlock::WORD_R2));
    return q_code;
}

//------------------------ Calculate syndrome for P-code (parity).
uint16_t STC007Deinterleaver::calcSyndromeP(STC007DataBlock *data_block)
{
    uint16_t syndrome;
    syndrome = calcPcode(data_block)^data_block->getWord(STC007DataBlock::WORD_P0);
    return syndrome;
}

//------------------------ Calculate syndrome for Q-code (B-adjacent).
uint16_t STC007Deinterleaver::calcSyndromeQ(STC007DataBlock *data_block)
{
    uint16_t syndrome;
    syndrome = calcQcode(data_block)^data_block->getWord(STC007DataBlock::WORD_Q0);
    return syndrome;
}

//------------------------ Recalculate P-word and make it valid.
void STC007Deinterleaver::recalcP(STC007DataBlock *data_block)
{
    bool suppress_log;
    uint16_t old_p, p_code;

    suppress_log = !((log_level&LOG_ERROR_CORR)!=0);

    // Save old word.
    old_p = data_block->getWord(STC007DataBlock::WORD_P0);
    // Calculate new value for P-code.
    p_code = calcPcode(data_block);
    if(old_p!=p_code)
    {
        // Store new P-word.
        data_block->setWord(STC007DataBlock::WORD_P0, p_code, data_block->isWordLineCRCOk(STC007DataBlock::WORD_P0), false);
        // Mark P-word as fixed.
        data_block->setFixed(STC007DataBlock::WORD_P0);
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            QString log_line;
            log_line.sprintf("[DI-007] P-code updated [0x%04x]->[0x%04x] and now valid", old_p, data_block->getWord(STC007DataBlock::WORD_P0));
            qInfo()<<log_line;
        }
#endif
    }
    else
    {
        // Mark P-word as valid.
        data_block->setValid(STC007DataBlock::WORD_P0);
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[DI-007] P-code doesn't need fixing, updated to be valid";
        }
#endif
    }
}

//------------------------ Calculate syndrome for P-code and fix an error.
uint8_t STC007Deinterleaver::fixByP(STC007DataBlock *data_block, uint8_t first_bad)
{
    bool suppress_log;
    uint16_t check, fix_word;

    data_block->markAsOriginalData();

    suppress_log = !((log_level&LOG_ERROR_CORR)!=0);

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        QString log_line;
        log_line = "[DI-007] Starting P-correction, bad index: ";
        if(first_bad==NO_ERR_INDEX)
        {
            log_line += "not set";
        }
        else
        {
            log_line += QString::number(first_bad);
        }
        qInfo()<<log_line;
    }
#endif

    // Calculate syndrome for P-code.
    check = calcSyndromeP(data_block);
    // Check if audio data needs to be fixed.
    if(check==0)
    {
        // Audio data is ok.
        if(first_bad!=NO_ERR_INDEX)
        {
            // Set sample as "ok" if it was marked with CRC.
            data_block->setValid(first_bad);
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[DI-007] Zero parity syndrome, the samples are ok. No error at"<<first_bad;
            }
#endif
        }
#ifdef DI_EN_DBG_OUT
        else
        {
            // No error pointer was set.
            if(suppress_log==false)
            {
                qInfo()<<"[DI-007] Zero parity syndrome, the samples are ok.";
            }
        }
#endif
        return FIX_NOT_NEED;
    }
    else if(first_bad==NO_ERR_INDEX)
    {
        // Error was detected, but there is no bad word pointer.
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            QString log_line;
            log_line.sprintf("[DI-007] Parity check failed [0x%04x] while no CRC markers were set, broken block!", check);
            qInfo()<<log_line;
        }
#endif
        // Data is broken.
        return FIX_BROKEN;
    }
    else
    {
        // Fix an error in the sample (flip errored bits in the word).
        fix_word = check^data_block->getWord(first_bad);
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            QString log_line;
            log_line.sprintf("[DI-007] Syndrome for P-code: [0x%04x], bad sample at [%01u], fix: [0x%04x]->[0x%04x]",
                             check, first_bad, data_block->getWord(first_bad), fix_word);
            qInfo()<<log_line;
        }
#endif
        // Replace damaged word marked as non-valid, bad CRC.
        data_block->setWord(first_bad, fix_word, false, data_block->isWordValid(first_bad));
        // Mark as fixed.
        data_block->setFixed(first_bad);
        return FIX_DONE;
    }
}

//------------------------ Calculate syndromes for P-code (parity) and Q-code (b-adjacent code),
//------------------------ fix damaged samples.
uint8_t STC007Deinterleaver::fixByQ(STC007DataBlock *data_block, uint8_t first_bad, uint8_t second_bad)
{
    bool suppress_log, fix_found;
    uint16_t synd_p, synd_q, error_first, error_second, fix_word1, fix_word2;

    synd_p = 0;
    fix_found = false;
    data_block->markAsOriginalData();

