Fagear/SDVPCMdecoder/stc007deinterleaver.cpp
    suppress_log = !((log_level&LOG_ERROR_CORR)!=0);

    // Check if second marker was not provided due to search only by audio samples.
    if(second_bad==NO_ERR_INDEX)
    {
        // Check if that can be P-code word.
        if(data_block->isWordValid(STC007DataBlock::WORD_P0)==false)
        {
            // Point second (empty) marker to P-code word.
            second_bad = STC007DataBlock::WORD_P0;
        }
    }

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        QString log_line;
        log_line = "[DI-007] Starting Q-correction, first bad index: ";
        if(first_bad==NO_ERR_INDEX)
        {
            log_line += "not set";
        }
        else
        {
            log_line += QString::number(first_bad);
        }
        log_line += ", second bad index: ";
        if(second_bad==NO_ERR_INDEX)
        {
            log_line += "not set";
        }
        else
        {
            log_line += QString::number(second_bad);
        }
        qInfo()<<log_line;
    }
#endif

    // Calculate syndrome for Q-code.
    synd_q = calcSyndromeQ(data_block);

    // Check if P-code is available.
    if(second_bad==STC007DataBlock::WORD_P0)
    {
        // Second corrupted word is P.
        if(synd_q==0)
        {
            // No error found in other words.
            if(first_bad!=NO_ERR_INDEX)
            {
                // Audio data is ok.
                data_block->setValid(first_bad);
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] No ECC error detected, the audio samples are ok. No error at"<<first_bad;
                }
#endif
            }
#ifdef DI_EN_DBG_OUT
            else
            {
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] No ECC error detected, the audio samples are ok.";
                }
            }
#endif
            // Fix P-word.
            recalcP(data_block);
            return FIX_NOT_NEED;
        }
    }
    else
    {
        // Both damaged words are audio data, check both syndromes.
        // Calculate syndrome for P.
        synd_p = calcSyndromeP(data_block);
        if((synd_p==0)&&(synd_q==0))
        {
            // Audio data is ok.
            data_block->setValid(first_bad);
            data_block->setValid(second_bad);
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[DI-007] No ECC error detected, the audio samples are ok";
            }
#endif
            return FIX_NOT_NEED;
        }
    }

    // Check is there are two bad audio samples and P-code (3 errors actually).
    //if(data_block->getErrorsTotal()>2)
    if((second_bad!=STC007DataBlock::WORD_P0)&&(data_block->isWordValid(STC007DataBlock::WORD_P0)==false))
    {
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[DI-007] There are more than 2 marked words, can not fix those errors";
        }
#endif
        // Data is bad.
        return FIX_NA;
    }

    // Check for correct first marker.
    if(first_bad==NO_ERR_INDEX)
    {
        // Error was detected, but there are no bad word pointers.
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            QString log_line;
            log_line.sprintf("[DI-007] ECC check failed [0x%04x][0x%04x] while no CRC markers were set, broken block!", synd_p, synd_q);
            qInfo()<<log_line;
        }
#endif
        // Data is broken.
        return FIX_BROKEN;
    }
    else if(second_bad==NO_ERR_INDEX)
    {
        // Error was detected, but there is only one bad word pointer.
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[DI-007] Data corruption is detected, but found only one CRC markers, switching to P-code correction";
        }
#endif
        // Switch to P-code correction.
        return FIX_SWITCH_P;
    }
    else
    {
        // Error was detected, error markers are set, proceed with correction.
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            QString log_line;
            log_line.sprintf("[DI-007] Syndromes for P-code and Q-code: [0x%04x], [0x%04x]", synd_p, synd_q);
            qInfo()<<log_line;
        }
#endif
        // Reset error locators.
        error_first = 0;
        error_second = 0;
        // Select branch by defective sample positions.
        if(first_bad==STC007DataBlock::WORD_L0)
        {
            if(second_bad==STC007DataBlock::WORD_R0)
            {
                // Branch #1: L0-R0.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN5_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP1IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #1 (L0-R0)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_L1)
            {
                // Branch #7: L0-L1.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN4_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP2IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #7 (L0-L1)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_R1)
            {
                // Branch #12: L0-R1.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN3_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP3IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #12 (L0-R1)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_L2)
            {
                // Branch #16: L0-L2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN2_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP4IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #16 (L0-L2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_R2)
            {
                // Branch #19: L0-R2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN1_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP5IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #19 (L0-R2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_P0)
            {
                // Branch #21: L0-P0.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN6_MATRIX, synd_q);
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #21 (L0-P0)";
                }
#endif
            }
        }
        else if(first_bad==STC007DataBlock::WORD_R0)
        {
            if(second_bad==STC007DataBlock::WORD_L1)
            {
                // Branch #2: R0-L1.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN4_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP1IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #2 (R0-L1)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_R1)
            {
                // Branch #8: R0-R1.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN3_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP2IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #8 (R0-R1)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_L2)
            {
                // Branch #13: R0-L2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN2_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP3IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #13 (R0-L2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_R2)
            {
                // Branch #17: R0-R2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN1_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP4IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #17 (R0-R2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_P0)
            {
                // Branch #20: R0-P0.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN5_MATRIX, synd_q);
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #20 (R0-P0)";
                }
#endif
            }
        }
        else if(first_bad==STC007DataBlock::WORD_L1)
        {
            if(second_bad==STC007DataBlock::WORD_R1)
            {
                // Branch #3: L1-R1.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN3_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP1IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #3 (L1-R1)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_L2)
            {
                // Branch #9: L1-L2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN2_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP2IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #9 (L1-L2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_R2)
            {
                // Branch #14: L1-R2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN1_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP3IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #14 (L1-R2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_P0)
            {
                // Branch #18: L1-P0.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN4_MATRIX, synd_q);
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #18 (L1-P0)";
                }
#endif
            }
        }
        else if(first_bad==STC007DataBlock::WORD_R1)
        {
            if(second_bad==STC007DataBlock::WORD_L2)
            {
                // Branch #4: R1-L2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN2_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP1IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #4 (R1-L2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_R2)
            {
                // Branch #10: R1-R2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN1_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP2IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #10 (R1-R2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_P0)
            {
                // Branch #15: R1-P0.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN3_MATRIX, synd_q);
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #15 (R1-P0)";
                }
#endif
            }
        }
        else if(first_bad==STC007DataBlock::WORD_L2)
        {
            if(second_bad==STC007DataBlock::WORD_R2)
            {
                // Branch #5: L2-R2.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN1_MATRIX, synd_q);
                error_first = error_first^synd_p;
                error_first = multMatrix((uint16_t *)TP1IN1_MATRIX, error_first);
                // Calculate error locator 2.
                error_second = error_first^synd_p;
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #5 (L2-R2)";
                }
#endif
            }
            else if(second_bad==STC007DataBlock::WORD_P0)
            {
                // Branch #11: L2-P0.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN2_MATRIX, synd_q);
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #11 (L2-P0)";
                }
#endif
            }
        }
        else if(first_bad==STC007DataBlock::WORD_R2)
        {
            if(second_bad==STC007DataBlock::WORD_P0)
            {
                // Branch #6: R2-P0.
                // Calculate error locator 1.
                error_first = multMatrix((uint16_t *)TN1_MATRIX, synd_q);
                fix_found = true;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[DI-007] Q-code branch #6 (R2-P0)";
                }
#endif
            }
        }
        // Check if error locators were found.
        if(fix_found!=false)
        {
            // Error locators were found.
            uint16_t old_word1, old_word2;
            // Calculate fix mask.
            old_word1 = data_block->getWord(first_bad);
            fix_word1 = old_word1^error_first;
            if(error_first!=0)
            {
                // Fix first word.
                data_block->setWord(first_bad, fix_word1, false, data_block->isWordCWDFixed(first_bad));    // Replace damaged words marked as non-valid, bad CRC.
                data_block->setFixed(first_bad);                                                            // Mark as valid.
            }
            else
            {
                // Nothing to fix, word was valid from the source.
                data_block->setValid(first_bad);
            }
            // Check special case for P-word (that only can be in the second place).
            old_word2 = data_block->getWord(second_bad);
            if(second_bad==STC007DataBlock::WORD_P0)
            {
                error_second = old_word2^calcPcode(data_block);
            }
            // Calculate fix mask.
            fix_word2 = old_word2^error_second;
            if(error_second!=0)
            {
                // Fix second word.
                data_block->setWord(second_bad, fix_word2, false, data_block->isWordCWDFixed(second_bad));
                data_block->setFixed(second_bad);
            }
            else
            {
                // Nothing to fix, word was valid from the source.
                data_block->setValid(second_bad);
            }
            if((error_first==0)&&(error_second==0))
            {
                // There was nothing to fix, all words were fine.
                return FIX_NOT_NEED;
            }
            else
            {
                // Audio data is corrected.
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    QString log_line;
                    log_line.sprintf("[DI-007] Bad samples at [%01u] and [%01u], fix: [0x%04x^0x%04x]->[0x%04x], [0x%04x^0x%04x]->[0x%04x]",
                                     first_bad, second_bad,
                                     old_word1, error_first, fix_word1,
                                     old_word2, error_second, fix_word2);
                    qInfo()<<log_line;
                }
#endif
                return FIX_DONE;
            }
        }
        else
        {
            // Error locator was not found. Probably bad branching due to incorrect input.
#ifdef QT_VERSION
            qWarning()<<DBG_ANCHOR<<"[DI-007] Unexpected branch. Logic error, data block is broken!";
#endif
            // Data is broken.
            return FIX_BROKEN;
        }
    }
}

//------------------------ Perform MATRIX x VECTOR multiplication.
//------------------------ Note that matrix has to be horizontally mirrored.
uint16_t STC007Deinterleaver::multMatrix(uint16_t *matrix, uint16_t vector)
{
    uint16_t res_vec;
    uint16_t temp_matrix[STC007Line::BITS_PER_WORD];  // Matrix container for Q-code calculations.
    res_vec = 0;
    for(uint8_t bit=0;bit<STC007Line::BITS_PER_WORD;bit++)
    {
        // Perform modulo-2 multiplication on input matrix.
        temp_matrix[bit] = matrix[bit]&vector;
        // XOR all bits in the line;
        if(bitXOR(temp_matrix[bit])!=0)
        {
            // Put result into output vector.
            res_vec |= (1<<bit);
        }
    }
    return res_vec;
}

//------------------------ Perform XOR on all bits in the word.
uint8_t STC007Deinterleaver::bitXOR(uint16_t vector)
{
    uint8_t res_bit;
    res_bit = 0;
    // Cycle through all bits in the word.
    for(uint8_t bit=0;bit<STC007Line::BITS_PER_WORD;bit++)
    {
        // XOR if bit is set.
        if((vector&0x0001)!=0)
        {
            res_bit = res_bit^0x01;
        }
        // Shift bits.
        vector = (vector>>1);
    }
    return res_bit;
}
